astarte-platform/astarte-device-sdk-esp32/src/astarte_device.c
    return NULL;
}

static void astarte_device_reinit_task(void *ctx)
{
    // This task will just wait for a notification and if it receives one, it will
    // reinit the device. This is necessary to handle the device certificate expiration,
    // that can't be handled in the event callback since that's executed in the mqtt
    // client task, that gets stopped to create a new mqtt client with the new certificate.

    astarte_device_handle_t device = (astarte_device_handle_t) ctx;

    while (1) {
        uint32_t notification_value = ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        if (notification_value & NOTIFY_TERMINATE) {
            // Terminate the task
            vTaskDelete(NULL);
        } else if (notification_value & NOTIFY_REINIT) {
            xSemaphoreTake(device->reinit_mutex, portMAX_DELAY);
            ESP_LOGI(TAG, "Reinitializing the device");
            // Delete the old certificate
            astarte_credentials_delete_certificate();
            // Retry until we succeed
            bool reinitialized = true;

            while (1) {
                astarte_err_t res
                    = astarte_device_init_connection(device, device->encoded_hwid, device->realm);
                if (res == ASTARTE_OK) {
                    break;
                }

                ESP_LOGE(TAG,
                    "Cannot reinit Astarte device: %d, trying again in %d "
                    "milliseconds",
                    res, REINIT_RETRY_INTERVAL_MS);
                vTaskDelay(REINIT_RETRY_INTERVAL_MS / portTICK_PERIOD_MS);

                // We check if the device got connected again. If it has, then we
                // can break away from the reinit process, since it was a false positive.
                // We deleted the certificate but the device will just ask for a new one
                // the next time it boots.
                if (device->connected) {
                    ESP_LOGI(TAG, "Device reconnected, skipping device reinitialization");
                    reinitialized = false;
                    break;
                }
            }

            if (reinitialized) {
                ESP_LOGI(TAG, "Device reinitialized, starting it again");
                esp_mqtt_client_start(device->mqtt_client);
            }

            xSemaphoreGive(device->reinit_mutex);
        }
    }
}

astarte_err_t astarte_device_init_connection(
    astarte_device_handle_t device, const char *encoded_hwid, const char *realm)
{
    if (!astarte_credentials_is_initialized()) {
        // TODO: this should be manually called from main before initializing the device,
        // but we just print a warning to maintain backwards compatibility for now
        ESP_LOGW(TAG,
            "You should manually call astarte_credentials_init before calling "
            "astarte_device_init");
        astarte_err_t err = astarte_credentials_init();
        if (err != ASTARTE_OK) {
            ESP_LOGE(TAG, "Error in astarte_credentials_init");
            return err;
        }
    }

    // If the device was already initialized, we free some resources first
    if (device->mqtt_client) {
        esp_mqtt_client_destroy(device->mqtt_client);
    }

    if (device->device_topic) {
        free(device->device_topic);
    }

    if (device->client_cert_pem) {
        free(device->client_cert_pem);
    }

    if (device->key_pem) {
        free(device->key_pem);
    }

    astarte_pairing_config_t pairing_config = {
        .base_url = CONFIG_ASTARTE_PAIRING_BASE_URL,
        .jwt = CONFIG_ASTARTE_PAIRING_JWT,
        .realm = realm,
        .hw_id = encoded_hwid,
    };

    if (device->credentials_secret) {
        pairing_config.credentials_secret = device->credentials_secret;
    }

    char credentials_secret[CREDENTIALS_SECRET_LENGTH];
    astarte_err_t err = astarte_pairing_get_credentials_secret(
        &pairing_config, credentials_secret, CREDENTIALS_SECRET_LENGTH);
    if (err != ASTARTE_OK) {
        ESP_LOGE(TAG, "Error in get_credentials_secret");
        return err;
    }
    ESP_LOGD(TAG, "credentials_secret is: %s", credentials_secret);

    char *client_cert_pem = NULL;
    char *client_cert_cn = NULL;
    char *key_pem = NULL;

    if (!astarte_credentials_has_certificate()) {
        err = retrieve_credentials(&pairing_config);
        if (err != ASTARTE_OK) {
            ESP_LOGE(TAG, "Could not retrieve credentials");
            goto init_failed;
        }
    }

    key_pem = calloc(PRIVKEY_LENGTH, sizeof(char));
    if (!key_pem) {
        ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
        goto init_failed;
    }
    err = astarte_credentials_get_key(key_pem, PRIVKEY_LENGTH);
    if (err != ASTARTE_OK) {
        ESP_LOGE(TAG, "Error in get_key");
        goto init_failed;
    } else {
        ESP_LOGD(TAG, "Key is: %s", key_pem);
    }

    client_cert_pem = calloc(CERT_LENGTH, sizeof(char));
    if (!client_cert_pem) {
        ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
        goto init_failed;
    }
    err = astarte_credentials_get_certificate(client_cert_pem, CERT_LENGTH);
    if (err != ASTARTE_OK) {
        ESP_LOGE(TAG, "Error in get_certificate");
        goto init_failed;
    } else {
        ESP_LOGD(TAG, "Certificate is: %s", client_cert_pem);
    }

    client_cert_cn = calloc(CN_LENGTH, sizeof(char));
    if (!client_cert_cn) {
        ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
        goto init_failed;
    }
    err = astarte_credentials_get_certificate_common_name(
        client_cert_pem, client_cert_cn, CN_LENGTH);
    if (err != ASTARTE_OK) {
        ESP_LOGE(TAG, "Error in get_certificate_common_name");
        goto init_failed;
    } else {
        ESP_LOGD(TAG, "Device topic is: %s", client_cert_cn);
    }

    char broker_url[URL_LENGTH];
    err = astarte_pairing_get_mqtt_v1_broker_url(&pairing_config, broker_url, URL_LENGTH);
    if (err != ASTARTE_OK) {
        ESP_LOGE(TAG, "Error in get_mqtt_v1_broker_url");
        goto init_failed;
    } else {
        ESP_LOGD(TAG, "Broker URL is: %s", broker_url);
    }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    const esp_mqtt_client_config_t mqtt_cfg
        = {.broker.address.uri = broker_url,
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
              .broker.verification.crt_bundle_attach = esp_crt_bundle_attach,
#endif
              .credentials.authentication.certificate = client_cert_pem,
              .credentials.authentication.key = key_pem,
          };
#else
    const esp_mqtt_client_config_t mqtt_cfg
        = {.uri = broker_url,
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
              .crt_bundle_attach = esp_crt_bundle_attach,
#endif
              .client_cert_pem = client_cert_pem,
              .client_key_pem = key_pem,
              .user_context = device,
              // TODO: At this time, the device starts with a clean session every connection,
              //  to change this behavior, it is necessary to enable disable_clean_session.
              //  Before enable it pay attention if the #issue-29 has been solved
              //  (see: https://github.com/astarte-platform/astarte-device-sdk-esp32/issues/29).
              //  .disable_clean_session = true,
          };
#endif

    esp_mqtt_client_handle_t mqtt_client = esp_mqtt_client_init(&mqtt_cfg);
    if (!mqtt_client) {
        ESP_LOGE(TAG, "Error in esp_mqtt_client_init");
        goto init_failed;
    }

