astarte-platform/astarte-device-sdk-esp32/src/astarte_device.c
exit:
    free(csr);
    free(cert_pem);
    return ret;
}

static astarte_err_t check_device(astarte_device_handle_t device)
{
    if (!device->mqtt_client) {
        ESP_LOGE(TAG, "NULL mqtt_client");
        return ASTARTE_ERR;
    }

    if (!device->device_topic) {
        ESP_LOGE(TAG, "NULL device_topic");
        return ASTARTE_ERR;
    }

    return ASTARTE_OK;
}

static size_t get_int_string_size(int number)
{
    size_t digits = 1;
    const int max_number_in_single_digit = 9;
    const int min_number_in_double_digit = 10;
    while (number > max_number_in_single_digit) {
        number /= min_number_in_double_digit;
        digits++;
    }
    return digits;
}

static size_t get_introspection_string_size(astarte_device_handle_t device)
{
    size_t introspection_size = 0;
    astarte_linked_list_iterator_t list_iter;
    astarte_err_t iter_err = astarte_linked_list_iterator_init(&device->introspection, &list_iter);
    while (iter_err != ASTARTE_ERR_NOT_FOUND) {
        astarte_interface_t *interface = NULL;
        astarte_linked_list_iterator_get_item(&list_iter, (void **) &interface);

        size_t major_digits = get_int_string_size(interface->major_version);
        size_t minor_digits = get_int_string_size(interface->minor_version);

        // The interface name in introspection is composed as  "name:major:minor;"
        introspection_size += strlen(interface->name) + major_digits + minor_digits + 3;

        iter_err = astarte_linked_list_iterator_advance(&list_iter);
    }
    return introspection_size;
}

static void send_introspection(astarte_device_handle_t device)
{
    if (check_device(device) != ASTARTE_OK) {
        return;
    }

    esp_mqtt_client_handle_t mqtt = device->mqtt_client;

    size_t introspection_size = get_introspection_string_size(device);

    // if introspection size is > 4KiB print a warning
    const size_t max_introspection_size = 4096;
    if (introspection_size > max_introspection_size) {
        ESP_LOGW(TAG, "The introspection size is > 4KiB");
    }

    char *introspection_string = calloc(introspection_size + 1, sizeof(char));
    if (!introspection_string) {
        ESP_LOGE(TAG, "Unable to allocate memory for introspection string");
        return;
    }
    int len = 0;

    astarte_linked_list_iterator_t list_iter;
    astarte_err_t iter_err = astarte_linked_list_iterator_init(&device->introspection, &list_iter);
    while (iter_err != ASTARTE_ERR_NOT_FOUND) {
        astarte_interface_t *interface = NULL;
        astarte_linked_list_iterator_get_item(&list_iter, (void **) &interface);

        len += sprintf(introspection_string + len, "%s:%d:%d;", interface->name,
            interface->major_version, interface->minor_version);

        iter_err = astarte_linked_list_iterator_advance(&list_iter);
    }
    // Remove last ; from introspection
    introspection_string[len - 1] = 0;
    // Decrease len accordingly
    len -= 1;

    ESP_LOGD(TAG, "Publishing introspection: %s", introspection_string);
    esp_mqtt_client_publish(mqtt, device->device_topic, introspection_string, len, 2, 0);
    free(introspection_string);
}

static void setup_subscriptions(astarte_device_handle_t device)
{
    if (check_device(device) != ASTARTE_OK) {
        return;
    }

    char topic[TOPIC_LENGTH];

    esp_mqtt_client_handle_t mqtt = device->mqtt_client;

    // Subscribe to control messages
    int ret = snprintf(topic, TOPIC_LENGTH, "%s/control/consumer/properties", device->device_topic);
    if ((ret < 0) || (ret >= TOPIC_LENGTH)) {
        ESP_LOGE(TAG, "Error encoding topic");
        return;
    }

    ESP_LOGD(TAG, "Subscribing to %s", topic);
    esp_mqtt_client_subscribe(mqtt, topic, 2);

    astarte_linked_list_iterator_t list_iter;
    astarte_err_t iter_err = astarte_linked_list_iterator_init(&device->introspection, &list_iter);
    while (iter_err != ASTARTE_ERR_NOT_FOUND) {
        astarte_interface_t *interface = NULL;
        astarte_linked_list_iterator_get_item(&list_iter, (void **) &interface);

        if (interface->ownership == OWNERSHIP_SERVER) {
            // Subscribe to server interface subtopics
            ret = snprintf(topic, TOPIC_LENGTH, "%s/%s/#", device->device_topic, interface->name);
            if ((ret < 0) || (ret >= TOPIC_LENGTH)) {
                ESP_LOGE(TAG, "Error encoding topic");
                continue;
            }
            ESP_LOGD(TAG, "Subscribing to %s", topic);
            esp_mqtt_client_subscribe(mqtt, topic, 2);
        }

        iter_err = astarte_linked_list_iterator_advance(&list_iter);
    }
}

static void send_emptycache(astarte_device_handle_t device)
{
    if (check_device(device) != ASTARTE_OK) {
        return;
    }

    esp_mqtt_client_handle_t mqtt = device->mqtt_client;

    char topic[TOPIC_LENGTH];
    int ret = snprintf(topic, TOPIC_LENGTH, "%s/control/emptyCache", device->device_topic);
    if ((ret < 0) || (ret >= TOPIC_LENGTH)) {
        ESP_LOGE(TAG, "Error encoding topic");
        return;
    }
    ESP_LOGD(TAG, "Sending emptyCache to %s", topic);
    esp_mqtt_client_publish(mqtt, topic, "1", 1, 2, 0);
}

static void on_connected(astarte_device_handle_t device, int session_present)
{
    device->connected = true;

    if (device->connection_event_callback) {
        astarte_device_connection_event_t event = {
            .device = device,
            .session_present = session_present,
            .user_data = device->callbacks_user_data,
        };

        device->connection_event_callback(&event);
    }

    if (session_present) {
        return;
    }

    setup_subscriptions(device);
    send_introspection(device);
    send_emptycache(device);
}

static void on_disconnected(astarte_device_handle_t device)
{
    device->connected = false;

    if (device->disconnection_event_callback) {
        astarte_device_disconnection_event_t event = {
            .device = device,
            .user_data = device->callbacks_user_data,
        };

        device->disconnection_event_callback(&event);
    }
}

