astarte-platform/astarte-device-sdk-esp32/src/astarte_device.c
static void on_incoming(
    astarte_device_handle_t device, char *topic, int topic_len, char *data, int data_len)
{
    if (check_device(device) != ASTARTE_OK) {
        return;
    }

    if (!device->data_event_callback) {
        ESP_LOGE(TAG, "data_event_callback not set");
        return;
    }

    if (strstr(topic, device->device_topic) != topic) {
        ESP_LOGE(TAG, "Incoming message topic doesn't begin with device_topic: %s", topic);
        return;
    }

    const size_t maximum_control_prefix_len = 512;
    char control_prefix[maximum_control_prefix_len];
    int ret
        = snprintf(control_prefix, maximum_control_prefix_len, "%s/control", device->device_topic);
    if ((ret < 0) || (ret >= maximum_control_prefix_len)) {
        ESP_LOGE(TAG, "Error encoding control prefix");
        return;
    }

    size_t control_prefix_len = strlen(control_prefix);
    if (strstr(topic, control_prefix)) {
        // Control message
        // NOLINTNEXTLINE(clang-analyzer-deadcode.DeadStores) Remove once control_topic is used.
        char *control_topic = topic + control_prefix_len;
        ESP_LOGD(TAG, "Received control message on control topic %s", control_topic);
        // TODO: on_control_message(device, control_topic, data, data_len);
        return;
    }

    // Data message
    if (topic_len < device->device_topic_len + strlen("/")
        || topic[device->device_topic_len] != '/') {
        ESP_LOGE(TAG, "No / after device_topic, can't find interface: %s", topic);
        return;
    }

    char *interface_name_begin = topic + device->device_topic_len + strlen("/");
    char *path_begin = strchr(interface_name_begin, '/');
    if (!path_begin) {
        ESP_LOGE(TAG, "No / after interface_name, can't find path: %s", topic);
        return;
    }

    int interface_name_len = path_begin - interface_name_begin;
    const size_t maximum_interface_name_len = 512;
    char interface_name[maximum_interface_name_len];
    ret = snprintf(interface_name, maximum_interface_name_len, "%.*s", interface_name_len,
        interface_name_begin);
    if ((ret < 0) || (ret >= maximum_interface_name_len)) {
        ESP_LOGE(TAG, "Error encoding interface name");
        return;
    }

    size_t path_len = topic_len - device->device_topic_len - strlen("/") - interface_name_len;
    const size_t maximum_path_len = 512;
    char path[maximum_path_len];
    ret = snprintf(path, maximum_path_len, "%.*s", path_len, path_begin);
    if ((ret < 0) || (ret >= maximum_path_len)) {
        ESP_LOGE(TAG, "Error encoding path");
        return;
    }

    if (!data && data_len == 0) {
        if (device->unset_event_callback) {
            astarte_device_unset_event_t event = {
                .device = device,
                .interface_name = interface_name,
                .path = path,
                .user_data = device->callbacks_user_data,
            };
            device->unset_event_callback(&event);
        } else {
            ESP_LOGE(
                TAG, "Unset data for %s received, but unset_event_callback is not defined", path);
        }
        return;
    }

    if (!astarte_bson_deserializer_check_validity(data, data_len)) {
        ESP_LOGE(TAG, "Invalid BSON document in data");
        return;
    }

    // Keep old deserializer for compatibility
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wdeprecated-declarations"
    uint8_t bson_value_type = 0U;
    const void *bson_value = astarte_bson_key_lookup("v", data, &bson_value_type);
    if (!bson_value) {
        ESP_LOGE(TAG, "Cannot retrieve BSON value from data");
        return;
    }
#pragma GCC diagnostic pop

    // Use new deserializer
    astarte_bson_document_t full_document = astarte_bson_deserializer_init_doc(data);
    astarte_bson_element_t v_elem;
    if (astarte_bson_deserializer_element_lookup(full_document, "v", &v_elem) != ASTARTE_OK) {
        ESP_LOGE(TAG, "Cannot retrieve BSON value from data");
        return;
    }

    astarte_device_data_event_t event = {
        .device = device,
        .interface_name = interface_name,
        .path = path,
        .bson_value = bson_value,
        .bson_value_type = bson_value_type,
        .bson_element = v_elem,
        .user_data = device->callbacks_user_data,
    };

    device->data_event_callback(&event);
}

static int has_connectivity()
{
    esp_http_client_config_t config
        = {.url = CONFIG_ASTARTE_CONNECTIVITY_TEST_URL,
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
              .crt_bundle_attach = esp_crt_bundle_attach,
#endif
          };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    esp_err_t err = esp_http_client_perform(client);

    int res = 0;
    const int http_bad_request = 400;
    if ((err == ESP_OK) && (esp_http_client_get_status_code(client) < http_bad_request)) {
        res = 1;
    }
    esp_http_client_cleanup(client);

    return res;
}

static void on_certificate_error(astarte_device_handle_t device)
{
    if (has_connectivity()) {
        ESP_LOGW(TAG, "Certificate error, notifying the reinit task");
        xTaskNotify(device->reinit_task_handle, NOTIFY_REINIT, eSetBits);
    } else {
        ESP_LOGD(TAG, "TLS error due to missing connectivity, ignoring");
        // Do nothing, the mqtt client will try to connect again
    }
}

static void mqtt_event_handler(
    void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data)
{
    (void) base;

    esp_mqtt_event_handle_t event = event_data;
    astarte_device_handle_t device = (astarte_device_handle_t) handler_args;
    switch ((esp_mqtt_event_id_t) event_id) {
        case MQTT_EVENT_BEFORE_CONNECT:
            ESP_LOGD(TAG, "MQTT_EVENT_BEFORE_CONNECT");
            break;

        case MQTT_EVENT_CONNECTED:
            ESP_LOGD(TAG, "MQTT_EVENT_CONNECTED");
            on_connected(device, event->session_present);
            break;

        case MQTT_EVENT_DISCONNECTED:
            ESP_LOGD(TAG, "MQTT_EVENT_DISCONNECTED");
            on_disconnected(device);
            break;

        case MQTT_EVENT_SUBSCRIBED:
            ESP_LOGD(TAG, "MQTT_EVENT_SUBSCRIBED, msg_id=%d", event->msg_id);
            break;

        case MQTT_EVENT_UNSUBSCRIBED:
            ESP_LOGD(TAG, "MQTT_EVENT_UNSUBSCRIBED, msg_id=%d", event->msg_id);
            break;

        case MQTT_EVENT_PUBLISHED:
            ESP_LOGD(TAG, "MQTT_EVENT_PUBLISHED, msg_id=%d", event->msg_id);
            break;

        case MQTT_EVENT_DATA:
            ESP_LOGD(TAG, "MQTT_EVENT_DATA");
            on_incoming(device, event->topic, event->topic_len, event->data, event->data_len);
            break;

        case MQTT_EVENT_ERROR:
            ESP_LOGD(TAG, "MQTT_EVENT_ERROR");
            if (event->error_handle->error_type == MQTT_ERROR_TYPE_ESP_TLS) {
                on_certificate_error(device);
            }
            break;

        default:
            // Handle MQTT_EVENT_ANY introduced in esp-idf 3.2
            break;
    }
}
